{
  "author": "Henry (AI Assistant)",
  "changes": [
    {
      "type": "replace",
      "find": "Hybrid Human-AI Clinical Reasoning",
      "replace": "Hybrid Human–AI Clinical Reasoning"
    },
    {
      "type": "replace",
      "find": "demands more than technical proficiency; it requires a",
      "replace": "demands more than technical proficiency; it requires an entirely new"
    },
    {
      "type": "replace",
      "find": "rather than explicit causal modeling.",
      "replace": "rather than explicit causal modeling, a distinction with direct clinical implications."
    },
    {
      "type": "replace",
      "find": "To move EPOCH from aspiration to action,",
      "replace": "To translate EPOCH into actionable practice,"
    },
    {
      "type": "replace",
      "find": "Competency development requires supervised practice",
      "replace": "Competency development demands supervised practice"
    }
  ],
  "comments": [
    {
      "anchor": "Cognitive choreography describes the deliberate orchestration",
      "text": "Central thesis. Consider opening with a brief clinical vignette to make the concept immediately tangible for readers."
    },
    {
      "anchor": "Empathy involves the capacity to understand and share",
      "text": "EPOCH is compelling. Has it been piloted in any residency programs? Even preliminary data would strengthen the implementation case for reviewers."
    },
    {
      "anchor": "LLMs exhibit poor metacognitive calibration",
      "text": "Strongest argument in the paper. Consider citing recent constitutional AI or RLHF calibration work as a counterpoint to preempt reviewer objections about rapid AI progress."
    },
    {
      "anchor": "We acknowledge that this framework requires empirical validation",
      "text": "Specify prioritized outcome measures for a pilot: diagnostic accuracy, time-to-decision, trainee confidence, inter-rater reliability on choreography pattern selection."
    },
    {
      "anchor": "Medical education must evolve accordingly",
      "text": "Strong close. Add a forward-looking sentence about how competencies may evolve with multimodal models, agentic AI, and real-time clinical copilots."
    }
  ]
}
